Repository: dwaiter/django-filebrowser-old
Catalog: locale/*/LC_MESSAGES/django.po
Languages: it

source: Ensure this value has at most %(max)d characters (it has %(length)d).
it: Assicurati che il testo abbia al massimo %(max)d caratteri (ora sono %(length)d)

source: Ensure this value has at least %(min)d characters (it has %(length)d).
it: Assicurati che il testo abbia come minimo %(min)d caratteri (ora sono %(length)d)

source: Extension %(ext)s is not allowed. Only %(allowed)s is allowed.
it: L'estensione %(ext)s è vietata. Sono accettate: %(allowed)s

source: The directory will automatically be converted to lowercase. Only letters, numbers, underscores and hyphens are allowed.
it: Il nome della cartella verrà sostituito con le lettere minuscole.Sono accettati solo lettere. numeri, underscore e accenti.

source: Only letters, numbers, underscores and hyphens are allowed.
it: Sono accettati solo lettere. numeri, underscore e accenti.

source: The directory already exists.
it: La cartella esiste già

source: The name will automatically be converted to lowercase. Only letters, numbers, underscores and hyphens are allowed.
it: Il nome del file verrà sostituito con le lettere minuscole.Sono accettati solo lettere. numeri, underscore e accenti.

source: The file/directory already exists.
it: Il file/cartella esiste già

source: Use Image Generator.
it: Usa il generatore di immagini

source: File already exists.
it: Il file esiste già

source: Filename is not allowed.
it: Filename non permesso

source: File extension is not allowed.
it: Estensione non permessa

source: Filesize exceeds allowed Upload Size.
it: Il file eccede il limite

source: Thumbnail creation failed.
it: Errore nella creazione delle thumbnail

source: Image creation failed.
it: Errore nella creazione dell'immagine

source: The directory %s was successfully created.
it: Cartella %s creata con successo

source: Permission denied.
it: Permesso negato

source: Error creating directory.
it: Errore nella creazione della cartella

source: Make directory
it: Nuova cartella

source: Upload successful.
it: Upload effettuato con successo

source: Select files to upload
it: Seleziona i file da uploadare

source: Thumbnail creation successful.
it: Creazione thumbnail effettuata con successo

source: The file %s was successfully deleted.
it: Eliminazione di %s effettuata con successo

source: The directory %s was successfully deleted.
it: Eliminazione di %s effettuata con successo

source: Error renaming Thumbnail.
it: Errore nella rinominazione delle thumbnail

source: Renaming was successful.
it: Rinominazione effettuata con successo

source: Error.
it: Errore

source: Rename "%s"
it: Rinomina "%s"

source: Successfully generated Images.
it: Immagini generate con successo

source: Make Directory
it: Nuova cartella

source: Multiple Upload
it: Chargement de fichiers

source: Make Thumbs
it: Genera le thumbnail

source: Generate Images
it: Genera le immagini

source: Submit
it: Invia

source: Help
it: Aiuto

source: Allowed
it: Accettate

source: Max. Filesize
it: Dimensione massima

source: Select File
it: Seleziona un file

source: Make Thumbnail
it: Genera la thumbnail

source: View Image
it: Guarda immagine

source: Generate Image Versions
it: Genera le immagini

source: Rename File
it: Rinomina il file

source: Delete File
it: Elimina il file

source: Delete Folder
it: Elimina la cartella

source: Filter
it: Filtro

source: By Date
it: Per data

source: Any Date
it: Qualsiasi data

source: Today
it: Oggi

source: Past 7 days
it: Ultimi 7 giorni

source: Past 30 days
it: Questo mese

source: This year
it: Quest'anno

source: By Type
it: Per tipo

source: All
it: Tutti

source: No Files Found
it: Nessun file trovato

source: No Files
it: Nessun file

source: Filename
it: Nome del file

source: Size
it: Dimensione

source: Date
it: Data
